<img src="Tarjeta.png">

# Recap Last Class!

En la última clase habíamos introducido Pandas!
    **Pandas es una librería open source Python para realizar análisis de datos**. 
Aunque Python es ya de por si un buen lenguaje para la preparación de datos, nunca ha sido excelente para realizar análisis (tendencia de usar R, SQL o incluso Excel para realizar este tipo de tareas), hasta la llegada de Pandas!

In [4]:
import pandas as pd 
import numpy as np

Además, vimos que Pandas introduce dos nuevas estructura de datos a Python:
- Series
- DataFrames
ambas construidas sobre NumPy; lo que las hace dos estructura de datos rápidas.

![title](https://storage.googleapis.com/lds-media/images/series-and-dataframe.width-1200.png)

Hoy introduciremos los DataFrames, el objeto por predilección del Data Science en Python!!

# Dataframes de Pandas

## Introducción

Un DataFrame de Python es una tabla 2-dimensional, potencialmente hetereogéna y con ejes etiquetados (filas y columnas).

Propiedades de los DataFrames:
  - Columnas pueden ser de distintos tipos de datos
  - modificable de tamaño
  - ejes etiquetados (filas y columnas)
  - se pueden realizar operaciones aritméticas en filas y columnas

Los DataFrames de Pandas consisten básicamente de 3 elementos principales:
-  datos (*data*)
-  filas (*rows*)
-  columnas (*columns*)

![title](https://media.geeksforgeeks.org/wp-content/uploads/finallpandas.png)

Un DataFrame de pandas se genera mediante el siguien constructor:

In [ ]:
# Series
df = pd.DataFrame( data, index,dtype, copy)
# Dataframes
df = pd.DataFrame( data, index, columns, dtype, copy)

**Importante!** La notación nos recomienda siempre que creemos DataFrames darles nombres con sentido, derivados del acrónimo **d**ata**f**rame: df, df1, df2 etc

|Parámetro|Descripción|
|--------|------------|
|**data**| Los datos que incorpora como unpit pueden tener varias formas como: *ndarray*, *series*, *list*, *dict*, o otros dataframes
|**index**| Al ser una estructura 2-d tanto las filas como las columnas llevan etiquetas, siendo **las etiquetas de las filas** predeterminadas a *np.arange(n)* si no se especifican de otra forma|
|**columns**| Las etiquetas de las columnas están prestablecidas a *np.arange(n)* si no se especifican de otra forma|
|**dtype**| Tipo de datos de **cada** columan|
|**copy**| Este comando se utiliza para copiar los datos inputados. Por default está a False

### Tipos de datos - dtype( )

Los DataFrames de pandas sostienen los siguientes tipos de datos:


![title](https://pbpython.com/images/pandas_dtypes.png)

## Creación de un DataFrame

Como hemos comentado, un DataFrame de pandas se puede originar con distintos tipos e inputs:
- listas (*list*)
- diccionarios (*dict*)
- Pandas Series
- Numpy ndarrays
- otros Pandas DataFrames

### Crear DataFrame vacío

El DataFrame más básico que podamos pensar es un DataFrame vacío de contenido

In [2]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

Vemos que no tenemos ni columnas ni índices de filas, simplemente tenemos un dataFrame vacío

### DataFrame de una Lista

Para crear un DataFrame a partir de una lista simplemente tenemos que pasarle al argumento **data** una lista o colección de listas.

#### EJEMPLO - DataFrame 1d - a partir de una lista

In [3]:
lista_datos = ['uno','dos','tres','cuatro','cinco']

In [4]:
df = pd.DataFrame(lista_datos)
df

        0
0     uno
1     dos
2    tres
3  cuatro
4   cinco



En este ejemplo nuestros **datos son muy similares a una lista**, por lo que **el dataframe sólo contiene una única columna**.

Además, no hemos especificado ni el nombre de la columna resultante ni los índices de las filas (etiqueta de cada elemento de la lista); por lo que el índice de columna y de filas coge el valor prestablecido, empezando por 0 hasta n; donde n es el nº de elementos que hay en el DataFrame
Vemos que asi definido es muy similar a las series

In [6]:
serie=pd.Series(data=lista_datos)
serie

0       uno
1       dos
2      tres
3    cuatro
4     cinco
dtype: object

#### EJEMPLO - DataFrame 2d - a partir de lista de listas

In [8]:
lista_de_listas = [["Ana",25], 
                   ["Yolanda", 35] , 
                   ["Eduardo", 14]]
lista_de_listas

[['Ana', 25], ['Yolanda', 35], ['Eduardo', 14]]

In [9]:
df = pd.DataFrame(lista_de_listas)

In [10]:
df

         0   1
0      Ana  25
1  Yolanda  35
2  Eduardo  14

Al pasar una lista de listas, el DataFrame aloca los elementos en 2 columnas con tantos elementos como parejas de listas tenía el objeto inicial. 

Fijémonos que todavía no hemos asignado ningún nombre a las columnas ni a las filas del DataFrame!
Si colocamos las lsitas de esta manera, el se limita a apilarlas igual que antes:

In [58]:
lista_de_listas = [['Tomás', 'Elena', 'Juana', 'Enrique'] , 
                   [28,34,29,42] ]
lista_de_listas

[['Tomás', 'Elena', 'Juana', 'Enrique'], [28, 34, 29, 42]]

In [59]:
df = pd.DataFrame(data=lista_de_listas)
df

       0      1      2        3
0  Tomás  Elena  Juana  Enrique
1     28     34     29       42

**EJERCICIO: Hacer una Serie con la lista anterior como fuente**

In [30]:
lista_de_listas

[['Ana', 25], ['Yolanda', 35], ['Eduardo', 14]]

In [34]:
np.array(lista_de_listas)

array([['Ana', '25'],
       ['Yolanda', '35'],
       ['Eduardo', '14']], dtype='<U7')

In [32]:
np.array(lista_de_listas)[:,1]

array(['25', '35', '14'], dtype='<U7')

In [46]:
np.array(lista_de_listas).T[0]

array(['Ana', 'Yolanda', 'Eduardo'], dtype='<U7')

In [49]:
Serie=pd.Series(data=np.array(lista_de_listas)[:,1], index=np.array(lista_de_listas).T[0])
Serie

Ana        25
Yolanda    35
Eduardo    14
dtype: object

#### EJEMPLO - DataFrame 2d - asignar nombre a columnas

Vemos que la primera columna son nombres mientras que la segunda es la edad de cada persona.

Para asignar nombre a las columnas simplemente tenemos que pasar una **lista de nombres** con **tantos nombres de columnas como columnas haya** al parámetro *columns()* del DataFrame

In [52]:
lista_de_listas = [["Ana",25], ["Yolanda", 35] , ["Eduardo", 14]]
columnas=['nomobre','edad']

In [53]:
df=pd.DataFrame(data=lista_de_listas, 
                columns=columnas)
df

   nomobre  edad
0      Ana    25
1  Yolanda    35
2  Eduardo    14

#### EJEMPLO - DataFrame 2d - Asignar nombre a columnas e índices

In [55]:
lista_de_listas = [["Ana",25], ["Yolanda", 35] , ["Eduardo", 14]]
columnas=['nomobre','edad']
index = ['estudiante 1', 'estudiante 2', 'estudiante 3']

In [56]:
df = pd.DataFrame( data = lista_de_listas, 
                   columns = columnas, 
                   index=index )
df

              nomobre  edad
estudiante 1      Ana    25
estudiante 2  Yolanda    35
estudiante 3  Eduardo    14

#### EJEMPLO - DataFrame 2d - Asignar nombre a columnas, índices y tipos de datos

In [57]:
df = pd.DataFrame(data = lista_de_listas, 
                  columns = columnas, 
                  index=index, 
                  dtype = 'float' )
df

              nomobre  edad
estudiante 1      Ana  25.0
estudiante 2  Yolanda  35.0
estudiante 3  Eduardo  14.0

### DataFrame de un diccionario de listas

Al crear un DataFrame hay que tener en mente las siguientes consideraciones:
   - si se especifica un etiquetado, la longitud del índice tiene que ser equivalente a la longitud de los arrays
   - si no se especifica un índice, por default el indexado será **range(n)** , donde **n** = longitud array
   
   - Las llaves del diccionario se cogen por default como nombres de las columnas


#### EJEMPLO - Creacion de un DataFrame desde un diccionario de listas, asignando etiquetas

In [72]:
diccionario_de_listas = {  "nombres": ['Tomás', 'Elena', 'Juana'] , 
                            "edades": [28,34,0],
                            "peso": [70,60,62]}
diccionario_de_listas

{'nombres': ['Tomás', 'Elena', 'Juana'],
 'edades': [28, 34, 0],
 'peso': [70, 60, 62]}

In [73]:
df2=pd.DataFrame(data=diccionario_de_listas)
df2

  nombres  edades  peso
0   Tomás      28    70
1   Elena      34    60
2   Juana       0    62

Añadimos las etiquetas que queramos:

In [63]:
indice=['Pac1','Pac2','Pac3']
indice

['Pac1', 'Pac2', 'Pac3']

In [64]:
df2=pd.DataFrame(data=diccionario_de_listas, index=indice)
df2

     nombres  edades  peso
Pac1   Tomás      28    70
Pac2   Elena      34    60
Pac3   Juana       0    62

Tenemos que comprobar que la longitud de los índices será coincidente con la longitud del DataFrame. Si no es asi, nos dara error

### DataFrame de una lista de diccionarios

Una lista de diccionarios nos sirve también para rellenar un DataFrame. 

**Las llaves del diccionario se cogen por default como nombres de las columnas**

#### EJEMPLO  - sin etiquetas en índice

In [66]:
lista_dicts = [{'a': 1, 'b': 2, 'd':5 },    
               {'a': 5, 'b': 10, 'c': 20},
               {'a': 3, 'b': 4, 'c': 8, 'd': 13}]
lista_dicts

[{'a': 1, 'b': 2, 'd': 5},
 {'a': 5, 'b': 10, 'c': 20},
 {'a': 3, 'b': 4, 'c': 8, 'd': 13}]

In [69]:
df3=pd.DataFrame(data=lista_dicts)
df3

   a   b     d     c
0  1   2   5.0   NaN
1  5  10   NaN  20.0
2  3   4  13.0   8.0

Añadimos las etiquetas que queramos al indice

In [74]:
indices=['E1','E2','E3']

In [75]:
df3.index=indices

In [76]:
df3

    a   b     d     c
E1  1   2   5.0   NaN
E2  5  10   NaN  20.0
E3  3   4  13.0   8.0

Varias observaciones:
- Una lista de *2* elementos nos da lugar a un DataFrame de *2* filas 
- Así como las Series, los DataFrames son autocompletos en el sentido que en el caso que las dimensiones de los elementos que colisionan en un Dataframe no sean compatibles, **en lugar de saltar un error, se generan tantas filas o columnas según union() y se llenan de nulos según corresponda**

**EJERCICIO:**
1. Vamos a crear un df a partir de una lista de diccionarios.
Esta lista va a contener dos diccionarios:
    - uno con elementos 2,3,4,1 con etiquetas: "a","b","c","d"
    - otro diccionario con elementos -1,2,3,1 con etiquetas: "a","d","e","b"
2. Etiqueta las filas con valor 'first' y 'second'

### DataFrame basado en Series
Tambien podemos crear un DataFrame a partir de varias Series

#### EJEMPLO - DataFrame desde un diccionario de Series

In [99]:
d = {'Serie 1' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'Serie 2' : pd.Series([4.0, 5.0, 6.0, 7.0], index=['d', 'e', 'f', 'g'])}
d

{'Serie 1': a    1
 b    2
 c    3
 dtype: int64,
 'Serie 2': d    4.0
 e    5.0
 f    6.0
 g    7.0
 dtype: float64}

In [101]:
df = pd.DataFrame(data=d)
df

   Serie 1  Serie 2
a      1.0      NaN
b      2.0      NaN
c      3.0      NaN
d      NaN      4.0
e      NaN      5.0
f      NaN      6.0
g      NaN      7.0

#### EJEMPLO - DataFrame desde una lista de Series

In [102]:
d = [pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     pd.Series([4.0, 5.0, 6.0, 7.0], index=['d', 'e', 'f', 'g'])]
d

[a    1
 b    2
 c    3
 dtype: int64,
 d    4.0
 e    5.0
 f    6.0
 g    7.0
 dtype: float64]

In [103]:
df = pd.DataFrame(data=d)
df

     a    b    c    d    e    f    g
0  1.0  2.0  3.0  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  4.0  5.0  6.0  7.0

## Basico de DataFrames

### Índices, Columnas y Valores
De forma análoga a las Series en los DataFrames tambien disponemos de las propiedades index, values y una nueva que es columns

In [94]:
# Creamos el DataFrame desde un diccionario de listas:
diccionario_gente = {'Nombre':  ['Tomás', 'Elena', 'Juana', 'Enrique'],
                     'Edad':    [28,34,29,42],
                     'Ciudad':  ['Barcelona',"Tarragona","Lleida","Huesca"], 
                     "Hermanos":[1,2,3,0]}

indices=["Estudiante 1","Estudiante 2","Estudiante 3","Estudiante 4" ]

df = pd.DataFrame(data=diccionario_gente, 
                  index =indices)
df

               Nombre  Edad     Ciudad  Hermanos
Estudiante 1    Tomás    28  Barcelona         1
Estudiante 2    Elena    34  Tarragona         2
Estudiante 3    Juana    29     Lleida         3
Estudiante 4  Enrique    42     Huesca         0

*Etiquetas del indices*

In [84]:
df.index

Index(['Estudiante 1', 'Estudiante 2', 'Estudiante 3', 'Estudiante 4'], dtype='object')

In [85]:
type(df.index)

pandas.core.indexes.base.Index

*Etiquetas de columnas*

In [86]:
df.columns

Index(['Nombre', 'Edad', 'Ciudad', 'Hermanos'], dtype='object')

In [87]:
type(df.columns)

pandas.core.indexes.base.Index

*Values del DataFrame*

In [97]:
df.values

array([['Tomás', 28, 'Barcelona', 1],
       ['Elena', 34, 'Tarragona', 2],
       ['Juana', 29, 'Lleida', 3],
       ['Enrique', 42, 'Huesca', 0]], dtype=object)

Podemos modificar las etiquetas de los indices y de las columnas directamente:

In [98]:
df.columns=['A','B','C','D']
df

                    A   B          C  D
Estudiante 1    Tomás  28  Barcelona  1
Estudiante 2    Elena  34  Tarragona  2
Estudiante 3    Juana  29     Lleida  3
Estudiante 4  Enrique  42     Huesca  0

### Exploración de DataFrames

#### Atributos de un DataFrame

Igual que las Series de Pandas, el objeto DataFrame tiene un conjunto de atributos (**df.atribute**) que nos permiten entender rápidamente el objeto:

|df.attribute|Descripción|
|----|----|
|**dtypes**| lista todos los tipos de datos de las columnas del dataframe |
|**columns**| lista el nombre de las columnas |
|**axes**| lista las etiquetas de las filas y nombres de las columnas |
|**ndim**| nº de dimensiones del dataframe|
|**size**| nº de elementos del dataframe|
|**shape**| devuelve  una tupla que representa la dimensionalidad del df, (*filas*x*columnas*)|
|**values**| representación NumPy de los datos|

Vamos a explorar un dataframe mediante los atributos del objeto.

In [108]:
d = {'uno' : pd.Series([10, 12, 3,5],    index=['fila1', 'fila2', 'fila3','fila4']), 
     'two' : pd.Series([15.0, 2.0, 4.0], index=['fila1', 'fila2', 'fila3'])}
d

{'uno': fila1    10
 fila2    12
 fila3     3
 fila4     5
 dtype: int64,
 'two': fila1    15.0
 fila2     2.0
 fila3     4.0
 dtype: float64}

In [109]:
dfs=pd.DataFrame(data=d)
dfs

       uno   two
fila1   10  15.0
fila2   12   2.0
fila3    3   4.0
fila4    5   NaN

In [113]:
dfs.shape

(4, 2)

In [115]:
dfs.ndim

(2, 4)

In [116]:
dfs.dtypes

uno      int64
two    float64
dtype: object

In [110]:
dfs.axes

[Index(['fila1', 'fila2', 'fila3', 'fila4'], dtype='object'),
 Index(['uno', 'two'], dtype='object')]

In [111]:
dfs.index

Index(['fila1', 'fila2', 'fila3', 'fila4'], dtype='object')

In [112]:
dfs.columns

Index(['uno', 'two'], dtype='object')

#### Métodos de un DataFrame

**Importante!** A diferencia de los atributos, **los métodos de un objeto de Python llevan paréntesis**

**Importante!** Recordemos que para conocer todos los métodos y atributos de un objeto de Python, usar la función

dir(objeto)

|df.**method()**|Descripción|
|----|----|
|**info()**| información básica del df
|**head(n)**| lista las primeras *n* filas |
|**tail(n)**| lista las últimas *n* filas |
|**describe()**| genera algunas métricas estadísticas descriptivas del dataframe, sólo para columnas numérics |
|**max()**| devuelve el valor máximo de cada columna numérica |
|**min()**| devuelve el valor mínimo de cada columna numérica |
|**std()**| devuelve la desviación estándar de cada columna numérica |
|**sample(n)**| devuelve un set aleatorio del dataframe |
|**dropna()**| elimina todos los elementos con valores nulos |

In [1]:
diccionario_gente = {
    
    'Nombre':['Tomás', 'Elena', 'Juana', 'Enrique'],
    'Edad':[28,34,29,42],
    'Ciudad':['Barcelona',"Tarragona",2,"Huesca"], 
    "Hermanos":[1,2,3,0]
}
diccionario_gente

{'Nombre': ['Tomás', 'Elena', 'Juana', 'Enrique'],
 'Edad': [28, 34, 29, 42],
 'Ciudad': ['Barcelona', 'Tarragona', 2, 'Huesca'],
 'Hermanos': [1, 2, 3, 0]}

Ejercicio: Genera un df del diccionario anterior y asígnale como indice de filas "Estudiante 1", "Estudiante 2", etc, y aplica cada uno de los métodos de la tabla anterior. Comentemos resultados.

In [4]:
df=pd.DataFrame(data=diccionario_gente, index=['EST.1','EST.2','EST.3','EST.4'])
df

        Nombre  Edad     Ciudad  Hermanos
EST.1    Tomás    28  Barcelona         1
EST.2    Elena    34  Tarragona         2
EST.3    Juana    29          2         3
EST.4  Enrique    42     Huesca         0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, EST.1 to EST.4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    4 non-null      object
 1   Edad      4 non-null      int64
 2   Ciudad    4 non-null      object
 3   Hermanos  4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 160.0+ bytes

In [6]:
df.max()

Nombre      Tomás
Edad           42
Hermanos        3
dtype: object

### Trasponer el DataFrame - .T

In [9]:
df

        Nombre  Edad     Ciudad  Hermanos
EST.1    Tomás    28  Barcelona         1
EST.2    Elena    34  Tarragona         2
EST.3    Juana    29          2         3
EST.4  Enrique    42     Huesca         0

In [8]:
df.T

              EST.1      EST.2  EST.3    EST.4
Nombre        Tomás      Elena  Juana  Enrique
Edad             28         34     29       42
Ciudad    Barcelona  Tarragona      2   Huesca
Hermanos          1          2      3        0

### Ordenar DataFrame - sort_index(), sort_values()

#### Ordenar por índices - df.sort_index()

In [10]:
dic_coches = {'Marca':  ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
              'Precio': [22000,25000,27000,35000],
              'Año':    [2015,2013,2018,2018]
        }
df = pd.DataFrame(dic_coches)
df

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

In [12]:
df.sort_index()

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

Cambiamos el sentido de la ordenacion con el paramtro ascending

In [14]:
df.sort_index(ascending=False)

            Marca  Precio   Año
3         Audi A4   35000  2018
2      Ford Focus   27000  2018
1  Toyota Corolla   25000  2013
0     Honda Civic   22000  2015

Podemos seleccionar con que etiquetas ordenamos: Con los indices o con las columnas:

In [18]:
df.sort_index(axis=1)

    Año           Marca  Precio
0  2015     Honda Civic   22000
1  2013  Toyota Corolla   25000
2  2018      Ford Focus   27000
3  2018         Audi A4   35000

In [19]:
df.sort_index(axis=1, ascending=False)

   Precio           Marca   Año
0   22000     Honda Civic  2015
1   25000  Toyota Corolla  2013
2   27000      Ford Focus  2018
3   35000         Audi A4  2018

In [20]:
df.sort_index(axis=0)

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

#### Ordenar por values - df.sort_values()

In [21]:
df

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

In [22]:
df.sort_values(by=['Precio'], ascending=True)

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

In [23]:
df.sort_values(by=['Precio'], ascending=False)

            Marca  Precio   Año
3         Audi A4   35000  2018
2      Ford Focus   27000  2018
1  Toyota Corolla   25000  2013
0     Honda Civic   22000  2015

Podemos ordenar por valores en multiuples campos:

In [24]:
df.sort_values(by=['Año','Precio'])

            Marca  Precio   Año
1  Toyota Corolla   25000  2013
0     Honda Civic   22000  2015
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

Vemos que el Ford Focus aparece antes que  el Audi aun siendo del mismo año debido a que hemos ordenado también de menor a mayor precio

**Ejercicio:** 

    - Crea un DataFrame con el diccionario siguiente y ordena según:
        - Nombre de columnas en orden descendente.
        - Index en orden ascendente.
        - Por values utilizando las columnas Año, Precio y Marca de mayor a menor

In [26]:
dic_coches = {'Marca': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
        'Precio': [22000,25000,27000,35000],
        'Año': [2015,2013,2018,2018]
        }

### Missing Data

Pandas utiliza mayoritariamente el valor *np.nan* para representar valores nulos. 

Reindexar permite cambiar/añadir/borrar todo eje y puede generar nulos, como hemos visto. 

#### Borrar filas con missing data - .dropna( )

##### Borra toda fila con al menos un NaN

In [54]:
dic_coches = {'Marca': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
        'Precio': [22000,25000,27000, None],
        'Año': [2015,2013, None,2018]
        }

In [64]:
df = pd.DataFrame(dic_coches)
df

            Marca   Precio     Año
0     Honda Civic  22000.0  2015.0
1  Toyota Corolla  25000.0  2013.0
2      Ford Focus  27000.0     NaN
3         Audi A4      NaN  2018.0

In [29]:
df.dropna()

            Marca   Precio     Año
0     Honda Civic  22000.0  2015.0
1  Toyota Corolla  25000.0  2013.0

##### Borra las columnas con al menos un Nan
Lo hacemos con el parametro axis definido a 1 o 'columns'

In [31]:
df.dropna(axis=1)

            Marca
0     Honda Civic
1  Toyota Corolla
2      Ford Focus
3         Audi A4

In [32]:
df.dropna(axis='columns')

            Marca
0     Honda Civic
1  Toyota Corolla
2      Ford Focus
3         Audi A4

##### Borra todas las filas con TODOS los elementos Nan

In [33]:
df

            Marca   Precio     Año
0     Honda Civic  22000.0  2015.0
1  Toyota Corolla  25000.0  2013.0
2      Ford Focus  27000.0     NaN
3         Audi A4      NaN  2018.0

In [55]:
df_n=pd.DataFrame(df, columns=['Marca','Precio','Año','Modelo','Motor'])
df_n

            Marca   Precio     Año  Modelo  Motor
0     Honda Civic  22000.0  2015.0     NaN    NaN
1  Toyota Corolla  25000.0  2013.0     NaN    NaN
2      Ford Focus  27000.0     NaN     NaN    NaN
3         Audi A4      NaN  2018.0     NaN    NaN

In [56]:
df_n.dropna(how='all')

            Marca   Precio     Año  Modelo  Motor
0     Honda Civic  22000.0  2015.0     NaN    NaN
1  Toyota Corolla  25000.0  2013.0     NaN    NaN
2      Ford Focus  27000.0     NaN     NaN    NaN
3         Audi A4      NaN  2018.0     NaN    NaN

In [59]:
df_n.dropna(how='all',axis=1)

            Marca   Precio     Año
0     Honda Civic  22000.0  2015.0
1  Toyota Corolla  25000.0  2013.0
2      Ford Focus  27000.0     NaN
3         Audi A4      NaN  2018.0

In [60]:
df

            Marca   Precio     Año
0     Honda Civic  22000.0  2015.0
1  Toyota Corolla  25000.0  2013.0
2      Ford Focus  27000.0     NaN
3         Audi A4      NaN  2018.0

In [61]:
df_r=pd.DataFrame(columns=['Marca','Precio','Año'], index=[0,1,2])
df_r

  Marca Precio  Año
0   NaN    NaN  NaN
1   NaN    NaN  NaN
2   NaN    NaN  NaN

In [62]:
df_r.dropna(axis=0)

Empty DataFrame
Columns: [Marca, Precio, Año]
Index: []

In [63]:
df_r

  Marca Precio  Año
0   NaN    NaN  NaN
1   NaN    NaN  NaN
2   NaN    NaN  NaN

In [65]:
df_n.dropna(how='any')

Empty DataFrame
Columns: [Marca, Precio, Año, Modelo, Motor]
Index: []

In [66]:
df_n

            Marca   Precio     Año  Modelo  Motor
0     Honda Civic  22000.0  2015.0     NaN    NaN
1  Toyota Corolla  25000.0  2013.0     NaN    NaN
2      Ford Focus  27000.0     NaN     NaN    NaN
3         Audi A4      NaN  2018.0     NaN    NaN

#### Borra filas con cierto nº de NaN - .dropna( )

In [67]:
df_n.dropna(thresh=3)

            Marca   Precio     Año  Modelo  Motor
0     Honda Civic  22000.0  2015.0     NaN    NaN
1  Toyota Corolla  25000.0  2013.0     NaN    NaN

In [69]:
df_n.dropna(thresh=3,axis=1)

            Marca   Precio     Año
0     Honda Civic  22000.0  2015.0
1  Toyota Corolla  25000.0  2013.0
2      Ford Focus  27000.0     NaN
3         Audi A4      NaN  2018.0

In [70]:
df_n

            Marca   Precio     Año  Modelo  Motor
0     Honda Civic  22000.0  2015.0     NaN    NaN
1  Toyota Corolla  25000.0  2013.0     NaN    NaN
2      Ford Focus  27000.0     NaN     NaN    NaN
3         Audi A4      NaN  2018.0     NaN    NaN

#### Rellena NaN valores - .fillna( )

In [71]:
df_n.fillna(value=5)

            Marca   Precio     Año  Modelo  Motor
0     Honda Civic  22000.0  2015.0     5.0    5.0
1  Toyota Corolla  25000.0  2013.0     5.0    5.0
2      Ford Focus  27000.0     5.0     5.0    5.0
3         Audi A4      5.0  2018.0     5.0    5.0

In [72]:
df_n

            Marca   Precio     Año  Modelo  Motor
0     Honda Civic  22000.0  2015.0     NaN    NaN
1  Toyota Corolla  25000.0  2013.0     NaN    NaN
2      Ford Focus  27000.0     NaN     NaN    NaN
3         Audi A4      NaN  2018.0     NaN    NaN

#### Check dónde hay NaN - .isna( )

In [74]:
df_n.isna()

   Marca  Precio    Año  Modelo  Motor
0  False   False  False    True   True
1  False   False  False    True   True
2  False   False   True    True   True
3  False    True  False    True   True

In [76]:
df_n.isnull()

   Marca  Precio    Año  Modelo  Motor
0  False   False  False    True   True
1  False   False  False    True   True
2  False   False   True    True   True
3  False    True  False    True   True

In [77]:
df_n.isna().sum()

Marca     0
Precio    1
Año       1
Modelo    4
Motor     4
dtype: int64

## Subset DataFrames

Mientras que las expresiones estándar de Python y NumPy para seleccionar columnas son fáciles e intuititvas, existen métodos especiales para realizar subsets de dataframes:

- .loc: selecciona una fila/columna mediante su nombre
- .iloc: selecciona una fila/columna mediante su índice
- .at: selecciona un único elemento mediante su nombre
- .iat: selecciona un único elemento mediante su índice

### Selección de Columnas

In [196]:
dic_coches = {'Marca':  ['Honda','Toyota','Ford'],
              'Precio': [22000,25000,27000],
              'Año':    [2015,2013,2018]
        }
df = pd.DataFrame(dic_coches)
df.index = ["Prius","Corolla","Focus"]
df

         Marca  Precio   Año
Prius    Honda   22000  2015
Corola  Toyota   25000  2013
Focus     Ford   27000  2018

#### Mediante el nombre de la columna - [ ] como Series

Podemos seleccionar la columna deseada del dataframe mediante el nombre de la columna

In [197]:
df['Marca']

Prius      Honda
Corola    Toyota
Focus       Ford
Name: Marca, dtype: object

In [82]:
type(df['Marca'])

pandas.core.series.Series

In [198]:
df[['Marca','Precio']]

         Marca  Precio
Prius    Honda   22000
Corola  Toyota   25000
Focus     Ford   27000

In [81]:
df[['Marca']]

          Marca
Laura     Honda
Lorenzo  Toyota
Arnau      Ford

In [83]:
type(df[['Marca']])

pandas.core.frame.DataFrame

#### Mediante el nombre de la columna - [ [ ] ] como df

Si quisiéramos extrar una columna como un DataFrame, lo haríamos mediante el doble corchete

In [199]:
df[['Marca']]

         Marca
Prius    Honda
Corola  Toyota
Focus     Ford

In [200]:
type(df[['Marca']])

pandas.core.frame.DataFrame

#### Extraer múltiples columnas

Como un DataFrame es simplemente una lista de objetos, podemos extraer tantos como queramos mientras especifiquemos el nombre de las columnas

In [201]:
df[['Marca','Año']]

         Marca   Año
Prius    Honda  2015
Corola  Toyota  2013
Focus     Ford  2018

### Selección de Filas

Existen dos métodos para seleccionar filas de un DataFrame:
- **.loc[]** - **loc**aliza por el nombre
- **.iloc[]** - **loc**aliza por **í**ndice numérico

#### Selecciona por etiqueta - .loc[]

*df.loc[]* nos permite acceder a un grupo de filas y columnas mediante la etiqueta/s

In [203]:
df

         Marca  Precio   Año
Prius    Honda   22000  2015
Corola  Toyota   25000  2013
Focus     Ford   27000  2018

In [204]:
df.loc['Prius']

Marca     Honda
Precio    22000
Año        2015
Name: Prius, dtype: object

In [205]:
type(df.loc['Prius'])

pandas.core.series.Series

In [206]:
df.loc['Prius']['Marca']

'Honda'

In [207]:
df.loc['Prius'][0]

'Honda'

#### Selecciona por índice - .iloc()

Accedemos por el indice:

![title](https://www.w3resource.com/w3r_images/pandas-series-iloc-image-3.svg)

In [208]:
df.iloc[0]

Marca     Honda
Precio    22000
Año        2015
Name: Prius, dtype: object

In [209]:
df.iloc[0][0]

'Honda'

In [213]:
a = np.array([2,3,4,5])
matrix=[a,a*10,a*100]
matrix

[array([2, 3, 4, 5]), array([20, 30, 40, 50]), array([200, 300, 400, 500])]

In [211]:
# Recap XQ no uso una lista para esto
a=[2,3,4,5]
matrix=[a,a*10,a*100]
#matrix

In [214]:
df2 = pd.DataFrame(data=matrix, columns= ['p','q','r','s'])
df2

     p    q    r    s
0    2    3    4    5
1   20   30   40   50
2  200  300  400  500

In [215]:
df2.iloc[0]

p    2
q    3
r    4
s    5
Name: 0, dtype: int64

In [216]:
df2.loc[0]

p    2
q    3
r    4
s    5
Name: 0, dtype: int64

In [217]:
df2.loc[0]['p']

2

In [218]:
df2.loc[0].index

Index(['p', 'q', 'r', 's'], dtype='object')

In [219]:
df2.loc[0].values

array([2, 3, 4, 5], dtype=int64)

In [220]:
df2.iloc[0:2]

    p   q   r   s
0   2   3   4   5
1  20  30  40  50

In [221]:
df2.iloc[0:2]['p']

0     2
1    20
Name: p, dtype: int64

#### Mediante .loc[ ] e .iloc[ ] también podemos seleccionar columnas!

Recordemos que mediante slicing y el nombre de la columna podíamos obtener un subset del df con la columna deseada

In [222]:
df2["p"]

0      2
1     20
2    200
Name: p, dtype: int64

**Pero si hacemos uso del doble indexado también podemos usar .loc y .iloc para hacere subset de columnas**.

Para seleccionar la columna j tenemos que especificar que dada una columna queremos extraer todos sus elementos que se disponen en todas las filas del df.

Eso es, debemos especificar que queremos:
- dada la columna j
- todos los elementos de las filas

y según slicing de numpy arrays vimos que esto se escribe según: [ : , j ]

In [223]:
#seleccionamos mediante el índice de tercera columna (índice 2), todas las filsa (:)
df2.iloc[:, 2]

0      4
1     40
2    400
Name: r, dtype: int64

In [224]:
#O lo que es lo mismo intercambiando el índice de posición de la columna deseada por su etiqueta con .loc
df2.loc[:, "p"]

0      2
1     20
2    200
Name: p, dtype: int64

#### Seleccionar múltiples filas

In [226]:
dic_coches = {'Marca': ['Honda','Toyota','Ford','Audi', 'Seat'],
        'Precio': [22000,25000,27000,35000,17000],
        'Año': [2015,2013,2018,2018,2017]
        }
df = pd.DataFrame(dic_coches)
df.index = ["Civic","Corolla","Focus","A4","Leon"]
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   17000  2017

In [227]:
# Obtenemos un df con hasta la fila 2 
df.iloc[:2]

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013

In [229]:
# Obtenemos un df que contiene las filas "Civic" y "Corolla"
df.loc[["Civic","Corolla"]]

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013

In [230]:
 df.iloc[0:2, 0]

Civic       Honda
Corolla    Toyota
Name: Marca, dtype: object

In [231]:
 df.loc[["Civic","Corolla"], 'Marca']

Civic       Honda
Corolla    Toyota
Name: Marca, dtype: object

### Selecciona un elemento - .at[ ], .iat[ ]

#### Selecciona un elemento por etiqueta -.at[ ]

df.at[ ] nos permite seleccionar un único elemento del dataframe mediante su etiqueta

In [232]:
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   17000  2017

In [233]:
# El primer elemento es la etiqueta de la fila y el segundo la etiqueta de la columna
df.at['Civic','Año']

2015

#### Selecciona un elemento por índice - .iat[ ]

df.at[ ] nos permite seleccionar un único elemento del dataframe mediante su índice

In [234]:
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   17000  2017

In [235]:
df.iat[2,2]

2018

![title](https://www.w3resource.com/w3r_images/pandas-series-iat-image-2.svg)

**Ejercicio:**
- Del siguiente DataFrame realiza lo siguiente:
- Genera un nuevo DataFrame de Marca y Precio.
- Genera una serie Año.
- Selecciona la fila Focus
- Selecciona las dos últimas filas.
- Selecciona el precio del Honda Civic

In [239]:
dic_coches = {'Marca': ['Honda','Toyota','Ford','Audi', 'Seat'],
        'Precio': [22000,25000,27000,35000,17000],
        'Año': [2015,2013,2018,2018,2017]
        }
df = pd.DataFrame(dic_coches)
df.index = ["Civic","Corolla","Focus","A4","Leon"]
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   17000  2017

In [240]:
df1=df[['Marca','Precio']]
df1

          Marca  Precio
Civic     Honda   22000
Corolla  Toyota   25000
Focus      Ford   27000
A4         Audi   35000
Leon       Seat   17000

In [241]:
s1=df['Año']
s1

Civic      2015
Corolla    2013
Focus      2018
A4         2018
Leon       2017
Name: Año, dtype: int64

In [242]:
df.loc['Focus']

Marca      Ford
Precio    27000
Año        2018
Name: Focus, dtype: object

In [243]:
df.iloc[-2:]

     Marca  Precio   Año
A4    Audi   35000  2018
Leon  Seat   17000  2017

In [244]:
df[-2:]

     Marca  Precio   Año
A4    Audi   35000  2018
Leon  Seat   17000  2017

In [245]:
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   17000  2017

In [246]:
df.iat[0,1]

22000

In [247]:
df.loc[ df['Marca']=='Honda','Precio' ]

Civic    22000
Name: Precio, dtype: int64

In [248]:
df['Marca']=='Honda'

Civic       True
Corolla    False
Focus      False
A4         False
Leon       False
Name: Marca, dtype: bool

### Selección condicional de filas

Además de seleccionar según filas y columnas, puede que queramos hacer una selección condicional, es decir; obtener valores de un dataframe que cumplan una condición determinada

#### Filtrar por condiciones booleanas
Es una de las formas de acceder mas utiles

**EJEMPLO:** Seleccionar los coches posteriores a 2016

In [249]:
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   17000  2017

In [250]:
df['Año'] > 2016

Civic      False
Corolla    False
Focus       True
A4          True
Leon        True
Name: Año, dtype: bool

In [251]:
df [ df['Año'] > 2016 ]

      Marca  Precio   Año
Focus  Ford   27000  2018
A4     Audi   35000  2018
Leon   Seat   17000  2017

**Filtrar por múltiples condiciones**

Incluso podemos realizar subset de dataframes con **Múltiples condiciones**

**EJEMPLO:**  
Seleccionar los coches posteriores a 2016 y por menos de 20000€

In [252]:
(df['Año'] > 2016) & (df['Precio'] < 20000)

Civic      False
Corolla    False
Focus      False
A4         False
Leon        True
dtype: bool

In [253]:
df[(df['Año'] > 2016) & (df['Precio'] < 20000)]

     Marca  Precio   Año
Leon  Seat   17000  2017

**Importante!** Cuando filtramos por múltiples condiciones conviene poner cada condición dentro de un paréntesis!!!

**Filtrar por contención - isin( )**

Otro tipo de filtro sería la comprobación de si una fila contiene un elemento que nos interese. Tal comprobación la haremos mediante el método *isin( )*

**EJEMPLO**
Filtra los coches que son del año 2018

In [254]:
df.isin([2018])

         Marca  Precio    Año
Civic    False   False  False
Corolla  False   False  False
Focus    False   False   True
A4       False   False   True
Leon     False   False  False

In [255]:
df['Año'].isin([2018])

Civic      False
Corolla    False
Focus       True
A4          True
Leon       False
Name: Año, dtype: bool

In [256]:
df [df['Año'].isin([2018])]

      Marca  Precio   Año
Focus  Ford   27000  2018
A4     Audi   35000  2018

**Ejercicio:**
- Del siguiente DataFrame realiza lo siguiente:
- Genera un nuevo DataFrame con los Precios menores a 30000 y año mayor a 2013.
- Genera un nuevo DataFrame donde se cumpla que el año es 2018 ó el Precio es menor a 20000.
- Genera un nuevo DataFrame donde Año sea solo 2013 y 2018.

In [2]:
dic_coches = {'Marca': ['Honda','Toyota','Ford','Audi', 'Seat'],
        'Precio': [22000,25000,27000,35000,17000],
        'Año': [2015,2013,2018,2018,2017]
        }
df = pd.DataFrame(dic_coches)
df.index = ["Civic","Corolla","Focus","A4","Leon"]
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   17000  2017

In [258]:
(df['Precio'] < 30000) & (df['Año'] > 2013)

Civic       True
Corolla    False
Focus       True
A4         False
Leon        True
dtype: bool

In [259]:
df[ (df['Precio'] < 30000) & (df['Año'] > 2013) ]

       Marca  Precio   Año
Civic  Honda   22000  2015
Focus   Ford   27000  2018
Leon    Seat   17000  2017

In [260]:
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   17000  2017

In [266]:
df.loc[ df['Año'].isin(['2015'])]

       Marca  Precio   Año
Civic  Honda   22000  2015

**Filtrar por contención - isin( )**

Otro tipo de filtro sería la comprobación de si una fila contiene un elemento que nos interese. Tal comprobación la haremos mediante el método *isin( )*

**EJEMPLO:**
Filtra los coches que son del año 2018

In [3]:
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   17000  2017

In [8]:
df.isin([2018])

         Marca  Precio    Año
Civic    False   False  False
Corolla  False   False  False
Focus    False   False   True
A4       False   False   True
Leon     False   False  False

In [4]:
df['Año'].isin([2018])

Civic      False
Corolla    False
Focus       True
A4          True
Leon       False
Name: Año, dtype: bool

In [9]:
df[df['Año'].isin([2018])]

      Marca  Precio   Año
Focus  Ford   27000  2018
A4     Audi   35000  2018

**Ejercicio:**
- Del siguiente DataFrame realiza lo siguiente:
- Genera un nuevo DataFrame con los Precios menores a 30000 y año mayor a 2013.
- Genera un nuevo DataFrame donde se cumpla que el año es 2018 ó el Precio es menor a 20000.
- Genera un nuevo DataFrame donde Año sea solo 2013 y 2018.

In [11]:
dic_coches = {'Marca': ['Honda','Toyota','Ford','Audi', 'Seat'],
        'Precio': [22000,25000,27000,35000,17000],
        'Año': [2015,2013,2018,2018,2017]
        }
df = pd.DataFrame(dic_coches)
df.index = ["Civic","Corolla","Focus","A4","Leon"]
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   17000  2017

## Setting de un DataFrame

### Modificar elementos

Modificar un elemento es tan sencillo como acceder a él y asignarle un nuevo valor!
Existen varios métodos para realizar tal tarea, los revisaremos a continuación.

#### Modificar un elemento según etiqueta - .at( )

In [12]:
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   17000  2017

In [13]:
df.at['Leon','Precio']

17000

In [14]:
df.at['Leon','Precio']=16000

In [15]:
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   16000  2017

#### Modificar un elemento según indice - .iat( )

In [16]:
df.iat[4,1]

16000

In [17]:
df.iat[4,1]=15500

In [18]:
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   15500  2017

#### Modificar elementos según etiquetas - .loc[] e indices - .iloc[]

In [19]:
df

          Marca  Precio   Año
Civic     Honda   22000  2015
Corolla  Toyota   25000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   15500  2017

In [21]:
df.loc[df['Año'] < 2017, 'Precio']=df['Precio']-1000

In [22]:
df

          Marca  Precio   Año
Civic     Honda   21000  2015
Corolla  Toyota   24000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   15500  2017

In [24]:
df.iloc[0:2,1]=df['Precio']-1000

In [25]:
df

          Marca  Precio   Año
Civic     Honda   20000  2015
Corolla  Toyota   23000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   15500  2017

#### Añadir columnas

Añadir una columna a un df es tan sencillo como:
1. asignar un nuevo nombre a la nueva columna del dataframe (eso genera una columna nueva vacía)
2. llenar la nueva columna con una lista o array, con mismas etiquetas que el df

**EJEMPLO**

In [26]:
df

          Marca  Precio   Año
Civic     Honda   20000  2015
Corolla  Toyota   23000  2013
Focus      Ford   27000  2018
A4         Audi   35000  2018
Leon       Seat   15500  2017

In [27]:
df['Kilometraje'] =  [1000,300000,20000,46777,55555]

In [28]:
df

          Marca  Precio   Año  Kilometraje
Civic     Honda   20000  2015         1000
Corolla  Toyota   23000  2013       300000
Focus      Ford   27000  2018        20000
A4         Audi   35000  2018        46777
Leon       Seat   15500  2017        55555

**Importante!!!** Si no llenáramos con tantos valores como filas tiene el dataframe, nos saltaría un error!

In [29]:
df['Stock']='Yes'

In [30]:
df

          Marca  Precio   Año  Kilometraje Stock
Civic     Honda   20000  2015         1000   Yes
Corolla  Toyota   23000  2013       300000   Yes
Focus      Ford   27000  2018        20000   Yes
A4         Audi   35000  2018        46777   Yes
Leon       Seat   15500  2017        55555   Yes

In [31]:
df['Precio-min']=df['Precio']-5000

In [32]:
df

          Marca  Precio   Año  Kilometraje Stock  Precio-min
Civic     Honda   20000  2015         1000   Yes       15000
Corolla  Toyota   23000  2013       300000   Yes       18000
Focus      Ford   27000  2018        20000   Yes       22000
A4         Audi   35000  2018        46777   Yes       30000
Leon       Seat   15500  2017        55555   Yes       10500

### Drop columnas - .pop( )

Para eliminar columnas de un dataframe usaremos el método *.pop( )*, especificando el nombre de la columna a eliminar. 

**EJEMPLO:**

In [33]:
df

          Marca  Precio   Año  Kilometraje Stock  Precio-min
Civic     Honda   20000  2015         1000   Yes       15000
Corolla  Toyota   23000  2013       300000   Yes       18000
Focus      Ford   27000  2018        20000   Yes       22000
A4         Audi   35000  2018        46777   Yes       30000
Leon       Seat   15500  2017        55555   Yes       10500

In [34]:
df.pop('Kilometraje')
df

          Marca  Precio   Año Stock  Precio-min
Civic     Honda   20000  2015   Yes       15000
Corolla  Toyota   23000  2013   Yes       18000
Focus      Ford   27000  2018   Yes       22000
A4         Audi   35000  2018   Yes       30000
Leon       Seat   15500  2017   Yes       10500

###  Eliminar filas - .drop( )

Para eliminar filas de un dataframe **usamos el índice** de los elementos que deseamos eliminar del Dataframe. Si el índice estuviera duplicado, se eliminarían múltiples filas.

In [36]:
df.drop('Leon')

          Marca  Precio   Año Stock  Precio-min
Civic     Honda   20000  2015   Yes       15000
Corolla  Toyota   23000  2013   Yes       18000
Focus      Ford   27000  2018   Yes       22000
A4         Audi   35000  2018   Yes       30000

In [37]:
df

          Marca  Precio   Año Stock  Precio-min
Civic     Honda   20000  2015   Yes       15000
Corolla  Toyota   23000  2013   Yes       18000
Focus      Ford   27000  2018   Yes       22000
A4         Audi   35000  2018   Yes       30000
Leon       Seat   15500  2017   Yes       10500

In [38]:
df.drop('Leon',inplace=True)

In [39]:
df

          Marca  Precio   Año Stock  Precio-min
Civic     Honda   20000  2015   Yes       15000
Corolla  Toyota   23000  2013   Yes       18000
Focus      Ford   27000  2018   Yes       22000
A4         Audi   35000  2018   Yes       30000

## Concatenar DataFrames -.append( ), -concat( )

### Introducción

Añadir una columna a un dataframe es una operación  vectorial, es decir; **elemento a elemento**

**Importante!** Recordar la propiedad de las Series en que no es necesaria congruencia de dimensiones entre dos DataFrames para operar entre ellos!

Si hubiera un mismatch de columnas o filas, el resultado de la operación **es la union de las dimensiones, llenando de nulos en aquellos ejes que uno de los dataframes no tuviera informado**

### Anexar filas - .append( )

Para añadir filas a un dataframe ya existente usaremos el método .append(); que anexiona filas al final de un dataframe

In [51]:
d = {'columna 1' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'columna 2' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
df

   columna 1  columna 2
a        1.0          1
b        2.0          2
c        3.0          3
d        NaN          4

**Append elemento con columnas coincidentes**

In [52]:
df.append(df)

   columna 1  columna 2
a        1.0          1
b        2.0          2
c        3.0          3
d        NaN          4
a        1.0          1
b        2.0          2
c        3.0          3
d        NaN          4

Si el elemento que anexamos tiene las mismas columnas que el dataframe destino, el método .append() añado los nuevos elementos al final

**Append si no tenemos mismas columnas**

In [53]:
nueva_fila = [[1,2]]
nueva_fila

[[1, 2]]

In [54]:
f = pd.DataFrame(nueva_fila)
f

   0  1
0  1  2

In [55]:
df = df.append(f)

In [56]:
df

   columna 1  columna 2    0    1
a        1.0        1.0  NaN  NaN
b        2.0        2.0  NaN  NaN
c        3.0        3.0  NaN  NaN
d        NaN        4.0  NaN  NaN
0        NaN        NaN  1.0  2.0

Vemos que si las columnas del dataframe a anexar son distintas al dataframe destino, se crean nuevas columnas con los nombres de las añadidas y se añaden los elementos al final de tales columnas. Es decir, **el append con columnas diferentes aumenta la dimensionalidad del dataframe no sólo a lo largo de las filas sino que también de las columnas**

### Concantenar - .concat( )

Podemos usar la función *concat()* de Pandas para juntar filas o columnas de un DataFrame a otro.


**Importante!** Cuando concatenamos DataFrames hay que **especificar el eje**. 

- **axis=0**: indica a pandas de juntar el segundo dataframe **debajo** del primero. Pandas detecta si los dos dataframes tienen los mismos nombres de columnas y si es así, procederá a anexionar el segundo debajo el primero a modo de **nuevas filas** en las columnas del primer dataframe.

- **axis=1**: indica a pandas de concatenar el segundo dataframe **a la derecha** del primero, a modo de **nuevas columnas** para las filas originales del dataset.

**EJEMPLO: Concatenar en axis=0**

In [57]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.284706  0.044297  1.247634  1.250415
1  1.015640 -0.708804  0.696185  0.178540
2 -1.728347 -0.204202 -1.050308 -0.716675
3  0.579841 -2.020793 -1.283906  0.768919
4  0.694098 -0.241210  0.180429 -0.239504
5  0.034887 -0.454749  0.245527  1.108180
6 -1.157249  0.668096 -1.520211 -0.214291
7 -1.476605 -0.518457  1.569554  0.504782
8 -0.401850 -1.486308  0.238076  0.269859
9  0.335085 -0.113940  0.995193 -0.389188

In [62]:
df.shape

(10, 4)

In [63]:
df2 = pd.DataFrame(np.random.randn(2, 2))
df2

          0         1
0  0.410975 -0.807489
1  0.046848 -0.608514

In [65]:
horizontal_stack = pd.concat([df,df2],axis=0)
horizontal_stack

          0         1         2         3
0 -0.284706  0.044297  1.247634  1.250415
1  1.015640 -0.708804  0.696185  0.178540
2 -1.728347 -0.204202 -1.050308 -0.716675
3  0.579841 -2.020793 -1.283906  0.768919
4  0.694098 -0.241210  0.180429 -0.239504
5  0.034887 -0.454749  0.245527  1.108180
6 -1.157249  0.668096 -1.520211 -0.214291
7 -1.476605 -0.518457  1.569554  0.504782
8 -0.401850 -1.486308  0.238076  0.269859
9  0.335085 -0.113940  0.995193 -0.389188
0  0.410975 -0.807489       NaN       NaN
1  0.046848 -0.608514       NaN       NaN

In [66]:
horizontal_stack.shape

(12, 4)

In [68]:
# OJO a los indices
horizontal_stack.drop(0)

          0         1         2         3
1  1.015640 -0.708804  0.696185  0.178540
2 -1.728347 -0.204202 -1.050308 -0.716675
3  0.579841 -2.020793 -1.283906  0.768919
4  0.694098 -0.241210  0.180429 -0.239504
5  0.034887 -0.454749  0.245527  1.108180
6 -1.157249  0.668096 -1.520211 -0.214291
7 -1.476605 -0.518457  1.569554  0.504782
8 -0.401850 -1.486308  0.238076  0.269859
9  0.335085 -0.113940  0.995193 -0.389188
1  0.046848 -0.608514       NaN       NaN

**EJEMPLO: Concatenar en axis=1**

In [70]:
vertical_stack = pd.concat([df,df2],axis=1)
vertical_stack

          0         1         2         3         0         1
0 -0.284706  0.044297  1.247634  1.250415  0.410975 -0.807489
1  1.015640 -0.708804  0.696185  0.178540  0.046848 -0.608514
2 -1.728347 -0.204202 -1.050308 -0.716675       NaN       NaN
3  0.579841 -2.020793 -1.283906  0.768919       NaN       NaN
4  0.694098 -0.241210  0.180429 -0.239504       NaN       NaN
5  0.034887 -0.454749  0.245527  1.108180       NaN       NaN
6 -1.157249  0.668096 -1.520211 -0.214291       NaN       NaN
7 -1.476605 -0.518457  1.569554  0.504782       NaN       NaN
8 -0.401850 -1.486308  0.238076  0.269859       NaN       NaN
9  0.335085 -0.113940  0.995193 -0.389188       NaN       NaN

In [71]:
vertical_stack.shape

(10, 6)

## Merge DataFrames- .merge( )

Como hemos visto, concatenar consta básicamente de juntar literalmente un dataframe a otro, en dirección vertical (añadiendo filas) o en dirección horizontal (añadiendo columnas).

Sin embargo, otra forma de combinar DataFrames con distinta información pero **usando las columnas de cada DataFrame que contienen valores comunes es el merge**. Lo definimos como **joining**. 

Las columnas que contiene valores comunes se llaman **join keys**.

**Realizar joins es especialmente útil para linkar tablas una de las cuales tiene información adicional (columnas adicionales) que complementa la tabla original**.

Este es el razonamiento usado en **SQL**.

El join se realiza mediante el comando *.merge( )*, que tiene los siguientes parámetros:

In [ ]:
merge(df_1, df_2, on, how)

Dónde:
- df_1: es el dataframe a unir con
- df_2: el segundo dataframe
- on: indica el join key o columna común a partir de la cual se combinan df_1 y df_2
- how: es el tipo de join a realizar

En Pandas existen **4 tipos de joins**

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/Pandas-Merge-and-Join-Functions-768x402.jpg)

##### Creamos dataframes para poder dar ejemplos

Creamos DataFrame **Clientes** y **Pedidos** Usaremos estos dos dataframes para trabajar los joins


![title](http://andresml.sytes.net/resources_classes/Data-Base.JPG)

In [6]:
customers={'cust_id':['a','b','c','d'],
           'name':['Alice','Bob','Carlos','Dieter'],
           'country':['us','ca','mx','de']}
df_customers=pd.DataFrame(data=customers)
df_customers

  cust_id    name country
0       a   Alice      us
1       b     Bob      ca
2       c  Carlos      mx
3       d  Dieter      de

Creamos DataFrame **Pedidos**

In [21]:
orders={'order_id':[1,2,3,4,5],
        'cust_id':['a','c','a','b','z'],
        'total':[1539,1871,6352,1456,2137]}
df_orders=pd.DataFrame(data=orders)
df_orders

   order_id cust_id  total
0         1       a   1539
1         2       c   1871
2         3       a   6352
3         4       b   1456
4         5       z   2137

### Inner Join

En un inner join, sólo los valores comunes entre los dos dataframes se conservan.

Es decir, devuelve los **valores que machean en ambas tablas**

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/pandas-Inner-join.jpg)

**EJEMPLO:** Hacemos el inner join de los dos dataset anteriores
![title](http://andresml.sytes.net/resources_classes/Inner-Join.JPG)

In [9]:
pedidos_df=pd.merge(df_customers,df_orders, on=['cust_id'], how='inner')
pedidos_df

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       a   Alice      us         3   6352
2       b     Bob      ca         4   1456
3       c  Carlos      mx         2   1871

EL Merge de los dos dataframes nos junta todas las columnas de los dos dataframes. Si solo queremos alguna, debremos de borrarla antes:

In [10]:
df_customers

  cust_id    name country
0       a   Alice      us
1       b     Bob      ca
2       c  Carlos      mx
3       d  Dieter      de

In [11]:
df_customers.drop(['country'],axis=1)

  cust_id    name
0       a   Alice
1       b     Bob
2       c  Carlos
3       d  Dieter

In [15]:
df_customers.drop(['country'],axis=1)

  cust_id    name
0       a   Alice
1       b     Bob
2       c  Carlos
3       d  Dieter

In [17]:
pedidos_df=pd.merge(df_customers.drop(['country'],axis=1),df_orders, on=['cust_id'], how='inner')
pedidos_df

  cust_id    name  order_id  total
0       a   Alice         1   1539
1       a   Alice         3   6352
2       b     Bob         4   1456
3       c  Carlos         2   1871

### Left join

Un Left Join **devuelve todos los elementos de la tabla de la izquierda** y sólo los elementos de la tabla derecha que machean con la tabla de la izquierda.

Es decir, la versión x de las columnas (de la tabla de la izquierda) consiste en todos los elementos de la tabla de la izquierda, los que machean y los que no, mientras que la versión y de las columnas (de la tabla de la derecha) sólo los elementas que machean con la tabla de la izquierda

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/Pandas-left-Join.jpg)

Hacemos el left join de los dos dataset anteriores
![title](http://andresml.sytes.net/resources_classes/Left-Join.JPG)

In [18]:
pedidos_df=pd.merge(df_customers,df_orders, on=['cust_id'], how='left')
pedidos_df

  cust_id    name country  order_id   total
0       a   Alice      us       1.0  1539.0
1       a   Alice      us       3.0  6352.0
2       b     Bob      ca       4.0  1456.0
3       c  Carlos      mx       2.0  1871.0
4       d  Dieter      de       NaN     NaN

### Right Join

Un **right join devuelve todos los registros de la tabla de la derecha** y los registros que machea de la tabla de la izquierda.

Es decir, la versión x de las columnas (del df de la izquierda) sólo mostraran los valores comunes y missing values, mientras que la versión y de las columnas mostrarán todos los valores, tanto los comunes como los únicos del segundo dataframe

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/Pandas-right-join.jpg)

Hacemos el right join de los dos dataset anteriores
![title](http://andresml.sytes.net/resources_classes/Right-Join.JPG)

In [22]:
pedidos_df=pd.merge(df_customers,df_orders, on=['cust_id'], how='right')
pedidos_df

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       a   Alice      us         3   6352
2       b     Bob      ca         4   1456
3       c  Carlos      mx         2   1871
4       z     NaN     NaN         5   2137

### Outer Join

Con un outer join de dos dataframes conseguimos en general un dataframe con todos los elementos de ambos dataframes.

Es decir, un outer join devuelve **todos los registros si hay un match en cualquiera de las tablas de la derecha o izquierda**

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/Pandas-Outer-Join.jpg)

Es decir, para cada atributo de una columna, tenemos una versión x y una versión y provinientes de cada dataframe. 

- La versión x pertenence al primer dataframe y consiste de los miembros de su propio dataset además de los miembros comunes con el segundo dataset. Mientras que los no comunes se tratan como missing vales. 
- La versión y es lo mismo pero tomando como origen el segundo dataset.

**El outer join devuelve todos los registros que machean entre las dos tablas, aunque los otros registros machean o no**

Hacemos el oter join de los dos dataset anteriores:
![title](http://andresml.sytes.net/resources_classes/Full-join.JPG)

In [23]:
pedidos_df=pd.merge(df_customers,df_orders, on=['cust_id'], how='outer')
pedidos_df

  cust_id    name country  order_id   total
0       a   Alice      us       1.0  1539.0
1       a   Alice      us       3.0  6352.0
2       b     Bob      ca       4.0  1456.0
3       c  Carlos      mx       2.0  1871.0
4       d  Dieter      de       NaN     NaN
5       z     NaN     NaN       5.0  2137.0

### Join vía indices - .join( )

**join()** es básicamente un método similar al merge pero que utiliza los índices como *keys* del merge

Así, el método *df.join()* es un método conveniente para combinar columnas de dos DataFrames potencialmente indexados de forma distinta y convertirlos en un mismo DataFrame

**EJEMPLO**

In [32]:
df_customers

  cust_id    name country
0       a   Alice      us
1       b     Bob      ca
2       c  Carlos      mx
3       d  Dieter      de

In [25]:
df_orders

   order_id cust_id  total
0         1       a   1539
1         2       c   1871
2         3       a   6352
3         4       b   1456
4         5       z   2137

In [34]:
A1=df_customers.set_index('cust_id')
A1

           name country
cust_id
a         Alice      us
b           Bob      ca
c        Carlos      mx
d        Dieter      de

In [35]:
A2=df_orders.set_index('cust_id')
A2

         order_id  total
cust_id
a               1   1539
c               2   1871
a               3   6352
b               4   1456
z               5   2137

In [36]:
A1.join(A2)

           name country  order_id   total
cust_id
a         Alice      us       1.0  1539.0
a         Alice      us       3.0  6352.0
b           Bob      ca       4.0  1456.0
c        Carlos      mx       2.0  1871.0
d        Dieter      de       NaN     NaN

## Grouping

Con el **"group by"** se hace referencia al proceso de:
- separar o **splitting** del DataFrame en grupos según algun criterio
- aplicar o **apply**ing una función a cada grupo independientemente
- combinar o **combine**ining los resultados en una estructura de datos

El group by nos permite agrupar un dataframe a nivel de valores únicos, aplicando una función de sumarización a las columnas restantes entorno al valor de índice

In [37]:
df = pd.DataFrame( {     
"Employee" : ["Susan", "Bart", "Emily", "Charles", "David", "Charles", "Julia", "Bart"] ,           
"City" : ["London", "London", "Philadelphia", "London", "London", "Philadelphia", "London", "Philadelphia"] ,
"Age" : [20, 40, 18, 24, 37, 40, 44, 20 ],
"Hours" : [24, 40, 50, 36, 54, 44, 41, 35]} ) 
df

  Employee          City  Age  Hours
0    Susan        London   20     24
1     Bart        London   40     40
2    Emily  Philadelphia   18     50
3  Charles        London   24     36
4    David        London   37     54
5  Charles  Philadelphia   40     44
6    Julia        London   44     41
7     Bart  Philadelphia   20     35

**EJEMPLO:** Caculamos la media de edad de nuestros empleados por ciudades

In [39]:
df.groupby('City').mean()

              Age  Hours
City
London         33     39
Philadelphia   26     43

In [40]:
df.groupby('City')['Age'].mean()

City
London          33
Philadelphia    26
Name: Age, dtype: int64

In [41]:
df[df['City']=='London'].groupby('City')['Age'].mean()

City
London    33
Name: Age, dtype: int64

**EJEMPLO:** Calculamos la maxima y la minima edad de nuestros empleados por ciudad

In [43]:
df.groupby('City')['Age'].max()

City
London          44
Philadelphia    40
Name: Age, dtype: int64

In [44]:
df.groupby('City')['Age'].min()

City
London          20
Philadelphia    18
Name: Age, dtype: int64

**EJEMPLO:** Número de empleados por ciudades

In [46]:
df.groupby('City')['Employee'].count()

City
London          5
Philadelphia    3
Name: Employee, dtype: int64

In [48]:
df.groupby('City').size()

City
London          5
Philadelphia    3
dtype: int64

**EJEMPLO:** Numero total de horas trabajadas por ciudad

In [49]:
df.groupby('City')['Hours'].sum()

City
London          195
Philadelphia    129
Name: Hours, dtype: int64

**EJEMPLO:** Numero total de horas trabajadas por ciudady su % respecto al total

In [51]:
df.groupby('City')['Hours'].sum()/df['Hours'].sum()

City
London          0.601852
Philadelphia    0.398148
Name: Hours, dtype: float64

### Group by a varios niveles

In [53]:
df['Office']=['Office 1','Office 2','Office 1','Office 1','Office 2','Office 2','Office 2','Office 1']

In [54]:
df

  Employee          City  Age  Hours    Office
0    Susan        London   20     24  Office 1
1     Bart        London   40     40  Office 2
2    Emily  Philadelphia   18     50  Office 1
3  Charles        London   24     36  Office 1
4    David        London   37     54  Office 2
5  Charles  Philadelphia   40     44  Office 2
6    Julia        London   44     41  Office 2
7     Bart  Philadelphia   20     35  Office 1

**EJEMPLO:** Agrupar por ciudad y oficina las media de horas trabajadas

In [55]:
df.groupby(['City','Office'])['Hours'].mean()

City          Office
London        Office 1    30.0
              Office 2    45.0
Philadelphia  Office 1    42.5
              Office 2    44.0
Name: Hours, dtype: float64

### Detalle de funciones de agregación o agrupación

|Función|Descripción|
|----|:------|
|mean()|Calcula la media del grupo|
|sum()|Calcula la suma del grupo de valores |
|size()|Calcula el tamaño del grupo|
|count()|Calcula el contador del grupo|
|std()|Calcula la desviación estandar del grupo|
|var()|Calcula la varianza del grupo|
|sem()|Calcula el error estandar del grupo|
|describe()|Genera estadística descriptiva|
|first()|Devuelve el primer elemento del grupo|
|last()|Devuelve el último elemento del grupo|
|nth()|Coge el *n*th elemento del grupo|
|min()|Calcula el valor mínimo del grupo|
|max()|Cacula el valor máximo del grupo|

### Aplicar múltiples funciones de golpe
**EJEMPLO:** Agrupar por ciudad y oficina las media, total, maximo y minimo de horas trabajadas

In [62]:
df

  Employee          City  Age  Hours    Office
0    Susan        London   20     24  Office 1
1     Bart        London   40     40  Office 2
2    Emily  Philadelphia   18     50  Office 1
3  Charles        London   24     36  Office 1
4    David        London   37     54  Office 2
5  Charles  Philadelphia   40     44  Office 2
6    Julia        London   44     41  Office 2
7     Bart  Philadelphia   20     35  Office 1

In [63]:
df[['Employee','City','Office','Age','Hours']]

  Employee          City    Office  Age  Hours
0    Susan        London  Office 1   20     24
1     Bart        London  Office 2   40     40
2    Emily  Philadelphia  Office 1   18     50
3  Charles        London  Office 1   24     36
4    David        London  Office 2   37     54
5  Charles  Philadelphia  Office 2   40     44
6    Julia        London  Office 2   44     41
7     Bart  Philadelphia  Office 1   20     35

In [66]:
df.groupby(['City','Office']).agg({'Hours':np.max,
                                    'Age':np.max})

                       Hours  Age
City         Office
London       Office 1     36   24
             Office 2     54   44
Philadelphia Office 1     50   20
             Office 2     44   40

In [67]:
df.groupby(['City','Office']).agg({'Hours':np.mean,
                                    'Age':np.mean})

                       Hours        Age
City         Office
London       Office 1   30.0  22.000000
             Office 2   45.0  40.333333
Philadelphia Office 1   42.5  19.000000
             Office 2   44.0  40.000000

In [68]:
df.groupby(['City','Office']).agg({'Hours':len})

                       Hours
City         Office
London       Office 1      2
             Office 2      3
Philadelphia Office 1      2
             Office 2      1

In [69]:
df.groupby(['City','Office']).size()

City          Office
London        Office 1    2
              Office 2    3
Philadelphia  Office 1    2
              Office 2    1
dtype: int64

In [70]:
type(df.groupby(['City','Office']).size())

pandas.core.series.Series

### Pivot Table

La principal función del "Pivot_table" son las agrupaciones de datos a las que se les suelen aplicar funciones matemáticas. Si no indicamos en el parámetro 'aggfunc' que opereción queremos hacer; por defecto, nos calculará la media de todas aquellas columnas que sean de tipo numérico.

In [71]:
df

  Employee          City  Age  Hours    Office
0    Susan        London   20     24  Office 1
1     Bart        London   40     40  Office 2
2    Emily  Philadelphia   18     50  Office 1
3  Charles        London   24     36  Office 1
4    David        London   37     54  Office 2
5  Charles  Philadelphia   40     44  Office 2
6    Julia        London   44     41  Office 2
7     Bart  Philadelphia   20     35  Office 1

In [72]:
df.pivot_table(index=['City'], values=['Age'], aggfunc=[np.mean,np.max, np.min])

             mean amax amin
              Age  Age  Age
City
London         33   44   20
Philadelphia   26   40   18

In [73]:
df.pivot_table(index=['City'], values=['Age','Hours'], aggfunc=[np.mean,np.max, np.min])

             mean       amax       amin
              Age Hours  Age Hours  Age Hours
City
London         33    39   44    54   20    24
Philadelphia   26    43   40    50   18    35

In [75]:
df.pivot_table(index=['City'], values=['Age','Hours'], aggfunc=[np.mean,np.max, np.min])

             mean       amax       amin
              Age Hours  Age Hours  Age Hours
City
London         33    39   44    54   20    24
Philadelphia   26    43   40    50   18    35

In [76]:
df.pivot_table(index=['City','Office'], values=['Age','Hours'], aggfunc=[np.mean,np.max, np.min])

                            mean       amax       amin
                             Age Hours  Age Hours  Age Hours
City         Office
London       Office 1  22.000000  30.0   24    36   20    24
             Office 2  40.333333  45.0   44    54   37    40
Philadelphia Office 1  19.000000  42.5   20    50   18    35
             Office 2  40.000000  44.0   40    44   40    44

# RESUMEN de métodos sobre DataFrames

## Métodos matemáticos

|Función|Description|
|:---|:---| 
|add()|Method is used to add series or list like objects with same length to the caller series|
|sub()|Method is used to subtract series or list like objects with same length from the caller series|
|mul()|Method is used to multiply series or list like objects with same length with the caller series|
|div()|Method is used to divide series or list like objects with same length by the caller series|
|sum()|Returns the sum of the values for the requested axis|
|prod()|Returns the product of the values for the requested axis|
|mean()|Returns the mean of the values for the requested axis|
|pow()|Method is used to put each element of passed series as exponential power of caller series and returned the results
|abs()|Method is used to get the absolute numeric value of each element in Series/DataFrame||
|cov()|Method is used to find covariance of two series|

## Métodos exploratorios

<style> table {display: block} </style>
|Función|Descripción|
|---|------|
|combine_first()|Method is used to combine two series into one|
|count()|Returns number of non-NA/null observations in the Series|
|size()|Returns the number of elements in the underlying data|
|name()|Method allows to give a name to a Series object, i.e. to the column|
|is_unique()|Method returns boolean if values in the object are unique|
|idxmax()|Method to extract the index positions of the highest values in a Series|
|idxmin()|Method to extract the index positions of the lowest values in a Series|
|sort_values()|Method is called on a Series to sort the values in ascending or descending order|
|sort_index()|Method is called on a pandas Series to sort it by the index instead of its values|
|head()|Method is used to return a specified number of rows from the beginning of a Series. The method returns a brand new Series|
|tail()|Method is used to return a specified number of rows from the end of a Series. The method returns a brand new Series|
|le()|Used to compare every element of Caller series with passed series.It returns True for every element which is Less than or Equal to the element in passed series|
|ne()|Used to compare every element of Caller series with passed series. It returns True for every element which is Not Equal to the element in passed series|
|ge()|Used to compare every element of Caller series with passed series. It returns True for every element which is Greater than or Equal to the element in passed series|
|eq()|Used to compare every element of Caller series with passed series. It returns True for every element which is Equal to the element in passed series|
|gt()|Used to compare two series and return Boolean value for every respective element|
|lt()|Used to compare two series and return Boolean value for every respective element|
|clip()|Used to clip value below and above to passed Least and Max value|
|clip_lower()|Used to clip values below a passed least value|
|clip_upper()|Used to clip values above a passed maximum value|
|astype()|Method is used to change data type of a series|
|tolist()|Method is used to convert a series to list|
|get()|Method is called on a Series to extract values from a Series. This is alternative syntax to the traditional bracket syntax|
|unique()|Pandas unique() is used to see the unique values in a particular column|
|nunique()|Pandas nunique() is used to get a count of unique values|
|value_counts()|Method to count the number of the times each unique value occurs in a Series|
|factorize()|Method helps to get the numeric representation of an array by identifying distinct values|
|map()|Method to tie together the values from one object to another|
|between()|Pandas between() method is used on series to check which values lie between first and second argument|
|apply()|Method is called and feeded a Python function as an argument to use the function on every Series value. This method is helpful for executing custom operations that are not included in pandas or numpy|